unit Unit_public;

interface
  uses inifiles,system.Classes,Unit_DM,Data.Win.ADODB,cxGrid,Vcl.Dialogs,cxGridExportLink,
        System.SysUtils;

  function DownLoadFile(sURL, sFName: string): boolean;
  function XiTong_date() :TDateTime;//ÏµÍ³Ê±¼ä
  function AutoCreateNo(aTableName:string;abeizhu:string):string;         //×Ô¶¯±àºÅ
  function ut_padstring(inString :string; maxLength :integer; padChar :char; left :boolean) :string;
  procedure DaochuExcel(agrid : TcxGrid);
  function jisuan_danjia(jmbh: string;ckshuliang:string): real;
  function ChaXunKuCun(jmbh:string):Real;
  Function HZToPY(cSTR:String):String;
  Function Getpinyin_shoupinma(hzchar: Ansistring): ansichar; //»ñµÃ³£ÓÃ×ÖÊ×Æ´Âë
  Function GetPinyin_shoupinma2(hz: String): ansiChar;//»ñÈ¡ÉúÆ§×ÖÊ×Æ´Âë

type
   Tuser = record
     userID :string;         //ÈËÔ±±àºÅ
     UserName : string;      //ÓÃ»§Ãû
     UserPassword:string;    //ÃÜÂë
     UserGW : string;         //¸ÚÎ»
   end;

var
  G_user : Tuser;
  G_IniSetingFile: TIniFile; //ÅäÖÃÎÄ¼þ
  G_LocalKey, G_RegisterCode: string;
  l_query:TADOQuery;


implementation


Function HZToPY(cSTR:String):String;
Var
 i:integer;
 S:String;
begin
  Result:='';
  for I := 1 to Length(cSTR) do
  begin
    S:=Copy(cSTR,i,1);
    if Trim(Getpinyin_shoupinma(S))='' then
      Result:=Result+S
    else
      Result:=Result+Getpinyin_shoupinma(S);
  end;
end;

Function Getpinyin_shoupinma(hzchar: Ansistring): ansichar; //»ñµÃ³£ÓÃ×ÖÊ×Æ´Âë
var
  i: Integer;
begin
  case WORD(hzchar[1]) shl 8 + WORD(hzchar[2]) of
    $B0A1..$B0C4 : Result := 'A';
    $B0C5..$B2C0 : Result := 'B';
    $B2C1..$B4ED : Result := 'C';
    $B4EE..$B6E9 : Result := 'D';
    $B6EA..$B7A1 : Result := 'E';
    $B7A2..$B8C0 : Result := 'F';
    $B8C1..$B9FD : Result := 'G';
    $B9FE..$BBF6 : Result := 'H';
    $BBF7..$BFA5 : Result := 'J';
    $BFA6..$C0AB : Result := 'K';
    $C0AC..$C2E7 : Result := 'L';
    $C2E8..$C4C2 : Result := 'M';
    $C4C3..$C5B5 : Result := 'N';
    $C5B6..$C5BD : Result := 'O';
    $C5BE..$C6D9 : Result := 'P';
    $C6DA..$C8BA : Result := 'Q';
    $C8BB..$C8F5 : Result := 'R';
    $C8F6..$CBF9 : Result := 'S';
    $CBFA..$CDD9 : Result := 'T';
    $CDDA..$CEF3 : Result := 'W';
    $CEF4..$D188 : Result := 'X';
    $D1B9..$D4D0 : Result := 'Y';
    $D4D1..$D7F9 : Result := 'Z';
    else Result := GetPinyin_shoupinma2(hzchar);
  end;
end;


function ChaXunKuCun(jmbh:string):Real;
var
  ADOQuery_danjia :TADOQuery;
begin
   Result:=-1;
   ADOQuery_danjia := TADOQuery.Create(nil);
   try
     ADOQuery_danjia.Connection := DataModule1.ADOCon_ALi;
     ADOQuery_danjia.Close;
     ADOQuery_danjia.SQL.Text:='select ¿â´æ=Èë¿âÊýÁ¿-³ö¿âÊýÁ¿-Î´½ÓÊÕ from ( select a.*, '+
      ' ³ö¿âÊýÁ¿=isnull((select sum(³ö¿âÊýÁ¿) from ÖÐÑë¿â´æ_³ö¿â±í where ×´Ì¬=2  and ÊÇ·ñ×÷·Ï=0 and ¼ÛÄ¿±àºÅ=a.¼ÛÄ¿±àºÅ) ,0), '+
      ' Î´½ÓÊÕ=isnull((select sum(³ö¿âÊýÁ¿) from ÖÐÑë¿â´æ_³ö¿â±í where ×´Ì¬=1  and ÊÇ·ñ×÷·Ï=0 and ¼ÛÄ¿±àºÅ=a.¼ÛÄ¿±àºÅ) ,0) '+
      ' from ( select ¼ÛÄ¿±àºÅ,sum(isnull(ÊýÁ¿,0)) as Èë¿âÊýÁ¿ from ÖÐÑë²É¹ºÈë¿âÃ÷Ï¸±í '+
      ' where Èë¿â±àºÅ in (select Èë¿â±àºÅ from ÖÐÑë²É¹ºÈë¿âÖ÷±í where ×´Ì¬=1) and ¼ÛÄ¿±àºÅ='+QuotedStr(jmbh)+' group by ¼ÛÄ¿±àºÅ '+
      ' )a left join Ò©Æ·ÓÃÆ·¼ÛÄ¿±í b on a.¼ÛÄ¿±àºÅ=b.¼ÛÄ¿±àºÅ )c';
     ADOQuery_danjia.Open;
     Result:=ADOQuery_danjia.FieldByName('¿â´æ').AsFloat;
   finally
     ADOQuery_danjia.Free;
   end;
end;


function jisuan_danjia(jmbh: string;ckshuliang:string): real;
var
  a,b,c,cb,ck:Real;
  ADOQuery_danjia :TADOQuery;
begin
   Result :=0;
   ADOQuery_danjia := TADOQuery.Create(nil);
   try
     ADOQuery_danjia.Connection := DataModule1.ADOCon_ALi;
     ADOQuery_danjia.SQL.Text := 'select * from ( select b.* , '+
     ' Åú´ÎÊ£Óà¿â´æÊý=(case when Ð¡ÓÚÅú´Î-³ö¿âÊýÁ¿<0 then (case when Ð¡ÓÚµÈÓÚÅú´Î-³ö¿âÊýÁ¿<0 then 0 else (Ð¡ÓÚµÈÓÚÅú´Î-³ö¿âÊýÁ¿) end '+
     '	) else b.ÊýÁ¿ end) from ( '+
     ' select * ,'+
     ' Ð¡ÓÚÅú´Î=isnull((select isnull(sum(ÊýÁ¿),0) from ÖÐÑë²É¹ºÈë¿âÃ÷Ï¸±í where Èë¿â±àºÅ in (select Èë¿â±àºÅ from ÖÐÑë²É¹ºÈë¿âÖ÷±í where ×´Ì¬=1 ) and ¼ÛÄ¿±àºÅ=a.¼ÛÄ¿±àºÅ and Èë¿âÅú´Î<a.Èë¿âÅú´Î),0),'+
     ' Ð¡ÓÚµÈÓÚÅú´Î=isnull((select isnull(sum(ÊýÁ¿),0) from ÖÐÑë²É¹ºÈë¿âÃ÷Ï¸±í where Èë¿â±àºÅ in (select Èë¿â±àºÅ from ÖÐÑë²É¹ºÈë¿âÖ÷±í where ×´Ì¬=1 ) and ¼ÛÄ¿±àºÅ=a.¼ÛÄ¿±àºÅ and Èë¿âÅú´Î<=a.Èë¿âÅú´Î),0),'+
     ' ³ö¿âÊýÁ¿=isnull((select sum(³ö¿âÊýÁ¿) from ÖÐÑë¿â´æ_³ö¿â±í where ×´Ì¬=2 and ÊÇ·ñ×÷·Ï=0 and ¼ÛÄ¿±àºÅ=a.¼ÛÄ¿±àºÅ),0)'+
     ' from ( select ¼ÛÄ¿±àºÅ,Èë¿âÅú´Î,½ø»õµ¥¼Û,ÊýÁ¿,±àºÅ from ÖÐÑë²É¹ºÈë¿âÃ÷Ï¸±í '+
     ' where ¼ÛÄ¿±àºÅ='+QuotedStr(jmbh)+' and Èë¿â±àºÅ in (select Èë¿â±àºÅ from ÖÐÑë²É¹ºÈë¿âÖ÷±í where ×´Ì¬=1 ) )a)b)c where Åú´ÎÊ£Óà¿â´æÊý>0  ' ;
     ADOQuery_danjia.Active := true;
     if ADOQuery_danjia.RecordCount >0 then
     begin
       ADOQuery_danjia.First;
       b := 0;
       c := 0;
       cb :=0;

       ck :=  StrToFloat(ckshuliang);
       while not ADOQuery_danjia.Eof do
       begin
         b := b+1;

         if ck <= ADOQuery_danjia.FieldByName('Åú´ÎÊ£Óà¿â´æÊý').AsFloat then
         begin
           if b=1 then
           begin
             Result := ADOQuery_danjia.FieldByName('½ø»õµ¥¼Û').AsFloat*StrToFloat(ckshuliang);
             Break;
           end
           else
           begin
             a := ck;
             c := adoquery_danjia.FieldByName('½ø»õµ¥¼Û').AsFloat;
             cb := cb+ a*c;
             Result := cb;
             Break;
           end;

         end
         else
         begin
           a := ADOQuery_danjia.FieldByName('Åú´ÎÊ£Óà¿â´æÊý').AsFloat;
           c := adoquery_danjia.FieldByName('½ø»õµ¥¼Û').AsFloat;

           if StrToFloat(ckshuliang) <= a then
           begin
             cb := cb+ a*c;
             Result := cb;
             Break;
           end
           else
           begin
             cb := cb+ a*c;
             ck := ck- ADOQuery_danjia.FieldByName('Åú´ÎÊ£Óà¿â´æÊý').AsFloat;
           end;

         end;
         ADOQuery_danjia.Next;
       end;

       if (Result =0) then
       begin
         if b=0 then
         begin
           cb := cb+ a*c;
           Result := cb;
         end else if b>0 then
         begin
           Result := cb+ck*c;
         end;
       end;

     end
     else
     begin
       ADOQuery_danjia.Active := false;
       ADOQuery_danjia.SQL.Text := 'select ½ø»õµ¥¼Û from ÖÐÑë²É¹ºÈë¿âÃ÷Ï¸±í where Èë¿âÅú´Î= (select max(Èë¿âÅú´Î)  from ÖÐÑë²É¹ºÈë¿âÃ÷Ï¸±í '+
       ' where ¼ÛÄ¿±àºÅ='+QuotedStr(jmbh)+' and Èë¿â±àºÅ in (select Èë¿â±àºÅ from ÖÐÑë²É¹ºÈë¿âÖ÷±í where ×´Ì¬=1 ) )';
       ADOQuery_danjia.Active := true;
       if ADOQuery_danjia.RecordCount>0 then
       begin
         Result := ADOQuery_danjia.FieldByName('½ø»õµ¥¼Û').AsFloat*StrToFloat(ckshuliang);
       end
       else
       begin
         Result := -1;
       end;
     end;
   finally
     ADOQuery_danjia.Free;
   end;
end;


procedure DaochuExcel(agrid: TcxGrid);
var
  savedialog1 : TSaveDialog;
begin
  try
    savedialog1 :=TSaveDialog.Create(nil);
    SaveDialog1.DefaultExt := 'xls';
    SaveDialog1.Filter :='(Excel±í¸ñÊ½xls)|*.xls';
    SaveDialog1.Title := 'ÇëÑ¡ÔñÒªÊä³öµÄÎÄ¼þ¼Ð';
    if SaveDialog1.Execute then
      ExportGridToExcel(SaveDialog1.FileName,agrid,True,True);
  finally
    savedialog1.Free;
  end;
end;

function XiTong_date() :TDateTime;
var
  L_query_date : TADOQuery;
begin
   L_query_date := TADOQuery.Create(nil);
   try
     L_query_date.Connection := DataModule1.ADOCon_ALi;
     L_query_date.SQL.Text := 'select getdate() as ÏµÍ³Ê±¼ä';
     L_query_date.Open;
     result := L_query_date.FieldByName('ÏµÍ³Ê±¼ä').AsDateTime;
   finally
     L_query_date.Free;
   end;
end;

function DownLoadFile(sURL, sFName: string): boolean;
var //ÏÂÔØÎÄ¼þ
  tStream: TMemoryStream;
begin
  tStream := TMemoryStream.Create;
  try //·ÀÖ¹²»¿ÉÔ¤ÁÏ´íÎó·¢Éú
    try
      DataModule1.IdHTTP_main.Get(sURL, tStream); //±£´æµ½ÄÚ´æÁ÷
      tStream.SaveToFile(sFName); //±£´æÎªÎÄ¼þ

      Result := True;
    finally //¼´Ê¹·¢Éú²»¿ÉÔ¤ÁÏµÄ´íÎóÒ²¿ÉÒÔÊÍ·Å×ÊÔ´
      tStream.Free;
    end;
  except //ÕæµÄ·¢Éú´íÎóÖ´ÐÐµÄ´úÂë
    Result := False;
    tStream.Free;
  end;
end;
function AutoCreateNo(aTableName: string;abeizhu:string): string;
var
  number : integer;
  cd,bhcd,cdmax:integer;
begin
  l_query:= TADOQuery.Create(nil);
  try
    l_query.Connection := DataModule1.ADOCon_ALi;
    l_query.close;
    l_query.sql.text := 'select * from ±àºÅ±í where ±àºÅÍ·='+ QuotedStr(aTableName)+' ';
    l_query.open;
    if l_query.Eof=True then
    begin
      l_query.Close;
      l_query.sql.text := 'insert into ±àºÅ±í(±àºÅÍ·,µ±Ç°±àºÅ,±àºÅ³¤¶È,±¸×¢)'+
                          ' values('+quotedstr(aTableName)+',''0'',''8'', '+quotedstr(abeizhu)+')';
      l_query.ExecSQL;
    end;

    l_query.Close;
    l_query.SQL.Text := 'select * from ±àºÅ±í where ±àºÅÍ· = '+ QuotedStr(aTableName);
    l_query.Open;

    number :=  l_query.FieldByName('µ±Ç°±àºÅ').AsInteger;
    cdmax:=1;
    bhcd := l_query.FieldByName('±àºÅ³¤¶È').AsInteger;
    for cd := 1 to bhcd-1 do
    cdmax := cdmax*10;

    while l_query.FieldByName('µ±Ç°±àºÅ').AsInteger<>number+1 do
    begin

      number :=  l_query.FieldByName('µ±Ç°±àºÅ').AsInteger;
      if number+1 > 9*cdmax then
      begin
        l_query.Close;
        l_query.SQL.Text := 'update ±àºÅ±í  set ±àºÅ³¤¶È = '+inttostr(bhcd+1)+' where ±àºÅÍ· = '+ QuotedStr(aTableName);
        l_query.ExecSQL;
      end;
      l_query.Close;
      l_query.SQL.Text := 'update ±àºÅ±í  set µ±Ç°±àºÅ = µ±Ç°±àºÅ+1 where ±àºÅÍ· = '+ QuotedStr(aTableName);
      l_query.ExecSQL;

      l_query.Close;
      l_query.SQL.Text := 'select * from ±àºÅ±í where ±àºÅÍ· = '+ QuotedStr(aTableName);
      l_query.Open;
    end;
    Result := l_query.fieldbyname('±àºÅÍ·').AsString +ut_padstring(IntToStr(l_query.fieldbyname('µ±Ç°±àºÅ').AsInteger),l_query.fieldbyname('±àºÅ³¤¶È').AsInteger,'0',True)
  finally
    l_query.Free;
  end;
end;
function ut_padstring(inString: string; maxLength: integer;
  padChar: char; left: boolean): string;
begin
  result := inString;
  while (Length(result) < maxLength) do
  if (left) then
    result := padChar + result
  else
    result := result + padChar;
end;

Function GetPinyin_shoupinma2(hz: String): ansiChar;//»ñÈ¡ÉúÆ§×ÖÊ×Æ´Âë
begin
  case hz[1] of
    'èñ': Result := 'A';
    'ï§': Result := 'A';
    'òü': Result := 'A';
    'ÜÐ': Result := 'B';
    'æß': Result := 'B';
    'ßÁ': Result := 'B';
    'îé': Result := 'B';
    'ÝÉ': Result := 'B';
    'çÍ': Result := 'B';
    'ôù': Result := 'C';
    'ÜÊ': Result := 'C';
    '÷ì': Result := 'D';
    'ôú': Result := 'D';
    'ßá': Result := 'D';
    'ß°': Result := 'D';
    'ÝÐ': Result := 'D';
    'ñ°': Result := 'D';
    'à¤': Result := 'D';
    'ñ¼': Result := 'D';
    'Ý­': Result := 'E';
    'ß»': Result := 'F';
    'Üò': Result := 'F';
    'ÜÕ': Result := 'G';
    'ëõ': Result := 'G';
    'îÜ': Result := 'G';
    'ëÒ': Result := 'G';
    'ßÉ': Result := 'G';
    'ë×': Result := 'G';
    'èÛ': Result := 'G';
    'õú': Result := 'H';
    'Ú­': Result := 'H';
    'çú': Result := 'H';
    'ñ¥': Result := 'H';
    'Üî': Result := 'H';
    'Üö': Result := 'H';
    'Þ½': Result := 'H';
    'ò»': Result := 'J';
    'éÈ': Result := 'J';
    'ëÂ': Result := 'J';
    'æº': Result := 'J';
    'à­': Result := 'K';
    'ØÑ': Result := 'K';
    'ó¹': Result := 'L';
    'ö¦': Result := 'L';
    'çÐ': Result := 'L';
    'òÃ': Result := 'L';
    'Þ¤': Result := 'L';
    'ßø': Result := 'L';
    'ì¢': Result := 'L';
    'ñª': Result := 'L';
    'Ý¹': Result := 'L';
    'Üß': Result := 'L';
    'ó¡': Result := 'M';
    '÷©': Result := 'M';
    'òú': Result := 'M';
    'Ý®': Result := 'M';
    'ßä': Result := 'M';
    'à×': Result := 'M';
    'ÜÔ': Result := 'M';
    'ÝÁ': Result := 'N';
    'à«': Result := 'N';
    'ëå': Result := 'N';
    'ßß': Result := 'P';
    'èË': Result := 'P';
    'ãú': Result := 'P';
    'ñ±': Result := 'P';
    'àÑ': Result := 'P';
    'çê': Result := 'P';
    'èÁ': Result := 'P';
    '°ò': Result := 'P';
    'öÄ': Result := 'Q';
    'ôÇ': Result := 'Q';
    'àº': Result := 'Q';
    'ÜÎ': Result := 'Q';
    'è½': Result := 'Q';
    'Üñ': Result := 'Q';
    'ÜË': Result := 'Q';
    'ìî': Result := 'Q';
    'ÛÏ': Result := 'Q';
    '÷×': Result := 'R';
    '÷ê': Result := 'S';
    'öè': Result := 'S';
//    '÷ê': Result := 'S';
    'àç': Result := 'S';
    'ðð': Result := 'S';
    'ëÄ': Result := 'T';
    'ÌÇ': Result := 'T';
    'Ù¢': Result := 'T';
    'ë¿': Result := 'W';
    'õ£': Result := 'X';
    'Ñª': Result := 'X';
//    'õ£': Result := 'X';
    'öÎ': Result := 'X';
    'õ¯': Result := 'X';
    '÷¨': Result := 'X';
    'åÐ': Result := 'X';
    'çÓ': Result := 'X';
    'Ü°': Result := 'X';
    'Üº': Result := 'X';
    'äå': Result := 'X';
    'ôè': Result := 'Y';
    'ö¸': Result := 'Y';
    'ßÅ': Result := 'Y';
    'âù': Result := 'Y';
    'éÚ': Result := 'Y';
    'åû': Result := 'Y';
    'ÒÇ': Result := 'Y';
    'õ¥': Result := 'Z';
//    'õ¥': Result := 'Z';
    'õÅ': Result := 'Z';
    'ßò': Result := 'Z';
    'ó¯': Result := 'Z';
    'óÃ': Result := 'Z';
//    'ó¯': Result := 'Z';
    'ô÷': Result := 'Z';
    'çÞ': Result := 'Z';
    'à©': Result := 'D';
    'é«': Result := 'Z';
    'Ýá': Result := 'B';
    'éÞ': Result := 'B';
    '‡f': Result := 'E';
    'Ü½': Result := 'F';
    'Ÿh': Result := 'J';
    'éÙ': Result := 'J';
    'óª': Result := 'P';
    'ôÈ': Result := 'S';
    '‹q': Result := 'T';
    'ðö': Result := 'Y';
    'Òº': Result := 'Y';
    '†¨': Result := 'Z';
    '°Y': Result := 'Z';
    'èÙ': Result := 'Z';
    'ëê': Result := 'Z';

    'ß¹', 'ï¹', 'àÄ', 'ïÍ', 'Þß', 'àÈ', 'ö°', 'íÁ', 'àÉ', 'æÈ', 'êÓ', 'è¨', {'èñ',}
    'âÖ', 'ÚÏ', 'ðÆ', 'Ûû', {'ï§',} 'Þî', 'áí', '÷ö', 'Ûê', 'à»', 'âÚ', 'éá', 'åÛ',
    'ñú'{, 'òü'}, '÷¡', '÷é', 'æÁ', 'á®', 'æñ', 'öË'{, 'âÚ'}:
    Result := 'a';
    'á±', 'ôÎ', 'ÜØ', 'ÝÃ', '÷É', 'öÑ', 'å±', 'êþ', 'Þã', 'ßÂ', 'ñ£', 'ñ­', 'Úæ',
    'Ûà', 'îÓ', 'ô²', 'äº', 'Ýò', 'Ùè'{, 'æß'}, 'ìÒ', 'öµ', 'ð±'{, 'Ýá'}, 'ñÙ', 'õÀ',
    'Úé', 'ðÇ', 'Úý', 'ã£', 'íÕ', 'Ýí', 'ñØ', '÷¹', 'öÍ', 'êÚ', 'ï¼', 'ÛÎ', 'ÛÐ',
    'àÔ', 'ê´', 'Ý©', 'Ø°'{, 'ßÁ'}, 'åþ', 'ïõ', 'ÙÂ', 'ô°', 'î¯', 'ßÙ', 'Üê', 'áù'{,
    'îé'}, 'æ¾', 'âØ'{, 'ÝÉ'}, 'åö', 'ã¹', 'óÙ', 'ää', 'ñÔ', 'õÏ', 'óë', 'æÔ', 'ó÷',
    'Þµ', 'å¨', '÷Â', 'èµ', 'ôÅ', 'í¾', 'óÖ', 'ìÔ', 'òù', 'öý', 'ñ¹', 'ØÒ', 'íÜ',
    'ñÛ', 'ÛÍ', 'âí', 'ãê'{, 'ÜÐ'}, 'çÂ', 'ì©', '÷Ô', 'æô', 'ñ¦', 'ïÚ', 'ì­', 'ì®',
    'ïð', 'æ»', 'ñÑ', '÷§', 'õ¿', 'ÙÏ'{, 'çÍ'}, 'éÄ', 'ïÙ', 'áÙ', 'éë', 'ë÷', '÷Æ',
    '÷Þ', 'Úû', 'Ù÷', 'Þð', 'âÄ', 'à£', 'ØÃ', 'Ùñ', 'îà', 'ð¾', 'õÛ', 'íç', 'õË',
    'ô¤', 'ë¢'{, 'éÞ'}, 'åÍ', 'îß', 'êÎ', 'õ³', 'ß²', 'îÐ', 'ê³', 'çã', 'å²', 'ðÚ':
    Result := 'b';
    'àê', 'íå', 'æî', '÷õ', 'ôÓ', 'è²', 'Ø÷', 'àÐ', 'äî', 'ô½', 'ó©', 'Ü³', 'âü',
    'á¯', 'ä¹', 'àá', 'è¾', 'âÇ', 'ïÊ', 'âª', 'é¶', 'éß', 'ñÃ', 'ïï', 'ãâ', 'æ±',
    'îÎ', 'Ù­', 'ò²', 'ðû', 'êè', 'æ¿', 'åî', 'ìø', 'âÜ', 'äý', 'ïâ', 'ó¸', 'õð',
    'ÚÆ', 'ÝÛ', 'Ùæ', 'âã', 'åñ', 'Øö', 'æ½', 'ÝÅ', 'ãÑ', 'öð', 'ÜÉ', 'áä', 'æÏ',
    'êÆ', 'ã®', 'ë©', 'âê', 'ÛË', 'â÷', 'ìÌ', 'êË', 'ñé', 'íº', 'åø', 'Ûå', 'ÞÓ',
    'è¡', 'àÁ', 'å·', 'ÚÈ', 'í×', 'ö³', 'é´', 'Úß', 'èß', 'òÉ', 'îõ', 'îª', 'Ø©',
    'èÇ', 'Ûô', 'îñ', 'ñÎ', 'ëó', 'õ¨', 'ßê', 'ò¿', 'ð·', 'í÷', 'ó×', 'àÍ', 'æÊ',
    'ó¤', '÷Î', 'ÜÝ', 'Ü¯', 'õØ', 'óø'{, 'ôù'}, 'ñÝ', 'áÜ', 'ß³', 'âÁ', 'ë·', 'à´',
    'ÙÑ', 'ñ¡', 'âç', 'Üû', 'ô©', 'ã¿', 'ô¾', 'ï¥', 'ñ¬', 'Ù±', 'àü', 'ã°', 'öÅ',
    'éË', 'Û»', 'òÜ', 'õé', 'èÆ', 'èú', 'ñÒ', 'Ø¡', 'âð', 'ç©', 'ãÀ', '÷í', 'Þõ',
    'à¨', 'àÜ', 'õß', 'çÝ', 'ë°', 'ô­', 'å×', 'â¶', 'îË', 'âë', 'Úï', 'é¢', 'é³',
    'òí', 'Ý»', 'ðÈ', 'õÖ', 'ê¡', 'öº', 'ßÚ', 'ìô', 'Üë', 'ðË', 'ôÙ'{, 'ÜÊ'}, 'èÈ',
    'æõ', 'è®', 'äÈ', 'çý', 'é¨', 'ëí', 'ê£', 'áÞ', 'éã', 'â§', 'Ýý', 'õ¾', 'õí',
    'ÙÛ', 'Ùà', 'ß¥', 'ïé', 'ìà', 'éÁ', 'è­', 'ßý', 'ã²', 'ÝÍ', 'ë¥', 'ñå', 'ââ',
    'õã', 'áÏ', 'ðî', 'ïó', 'õº', 'ëâ', 'ØÈ', 'ï±', 'ëú', 'å¤', 'æö':
    Result := 'c';
    'ßÕ', 'ÞÇ', 'àª', 'ñ×', 'æ§', 'âò', 'óÎ', '÷°', '÷²', 'á·'{, 'ß°'}, 'çª', 'åÊ',
    'çé', 'Ü¤'{, '÷ì'}, 'íñ', 'ñõ', 'éé', 'ð÷', 'óì', 'ÙÙ', 'ðã', 'à¢', 'ÝÌ', 'å£',
    'ñÉ', 'ÚÔ', 'ÛÊ', 'å´', 'í¸'{, 'ÝÐ'}, 'ß¶', 'âá', 'ë®', 'ôî', 'ï½', 'àâ', 'ô£',
    'ê­', 'áØ', 'íã', 'ïë', 'ôÆ', 'àÖ', 'ïá', 'Ùá', 'Ý¶', 'êë', 'Øµ', 'Ú®', 'Û¡',
    'Ûæ', 'èÜ', 'íÆ', '÷¾', 'æ·', 'ÚÐ', 'é¦', 'íû', 'íÚ', 'àÇ', 'áÛ', 'ñ²', 'õÚ',
    'Úç', 'Ûã', 'çè', 'îä'{, 'ñ°'}, 'ô¡', 'õõ', 'öô', 'îö', 'Ûì', 'ð¬', 'Ü¦', 'Þé',
    'ñó', 'ëº', 'õÞ', 'öø', 'Øê', 'çà', 'ðÛ', 'ñô'{, 'ôú'}{, 'à¤'}, 'ëë', 'íÖ', 'îû',
    'ßË', 'á´', 'ë±', 'ð´', 'Ûí', 'á¼', 'ëË', 'ëØ', 'íÏ', 'Ýú', 'óû', 'ò½'{, 'ñ¼'},
    'à½', 'äÂ', 'èü', 'ë¹', '÷ò', '÷Ç', 'óÆ', 'Ü¶', 'ó¼', 'é²', 'ìÑ', 'óý', 'í¡',
    'íÔ', 'í­', 'ïæ', 'íâ', 'íï', 'õ»', 'ãç', 'ìÀ', 'í»', 'ßÍ', 'ñÖ', 'îì', 'õâ'{,
    'ßá'}, 'ç¶', 'ãõ', 'Úà', 'Øé', 'êæ', 'ï¢', 'î®', 'îú', 'âº', 'Ø¼':
    Result := 'd';
    'åí'{, 'Ý­'}, 'ï°', 'æ¹', 'ßÀ', 'ÜÃ', 'éî', 'ÛÑ', 'ÚÌ', 'ãÕ', 'ãµ', 'Ýà', 'ëñ',
    'ïÉ', 'ðÊ', 'ò¦', 'Ø¬', 'öù', 'Ýì', 'Þô', 'ð¹', 'öÜ', 'åÇ', 'çí', 'îï', 'Ù¦',
    'àÅ', 'ßí', 'ÚÀ':
    Result := 'e';
    'ÛÒ', 'íÀ', 'á¦', 'Þ¬', 'ìÜ', 'õì', 'ÞÀ', 'î²', 'èó', 'Úú', 'èÊ', 'îÕ', 'öÐ',
    'ô³', 'åú', 'ç³', 'ìé', 'òã', 'ö­', 'öî', 'äÇ', 'ëè', 'ã­', 'ì³', 'é¼', 'ôä',
    'óõ', 'áô', 'ðò', 'ïÐ', 'èû', '÷÷', 'ÙÇ', 'ö÷', 'å¯', 'ãã', 'í¿', 'Ý×', 'Ûº',
    'ßô', 'Ùº', 'ó¾'{, 'ß»'}, 'õÃ', 'ôï', 'ïû', 'õÆ', 'Ùì', 'æÚ'{, 'Ü½'}, 'ÜÀ', 'âö',
    'ç¦', 'ç¨', 'ÜÞ', 'ìð', 'î·'{{, 'Üò'}, 'Û®', 'íÉ', 'Ý³', 'ò¶', 'Ùë', 'èõ', 'åõ',
    'ÝÊ', 'òÝ', 'á¥', 'òð', 'íê', 'ÞÔ', 'äæ', 'íë', 'æâ', 'öÖ', 'êç', 'òó', 'öû',
    'ð¥', 'ë¶', 'áë':
    Result := 'f';
    'ê¸', 'Ù¤', 'îÅ', 'æÙ', 'æØ', 'ÞÎ', 'Úë', 'Ûò', 'êà', 'Ø¤', 'ê®', 'Ûá', 'ãï'{,
    'ÜÕ'}, 'ðá', 'ôû', 'ÞÏ', 'ä÷', 'éÏ', 'ß¦', 'êº', 'í·', 'ç¤', 'äÆ', 'î¸', 'óà',
    'í°', 'éÀ', 'Øº', 'ê½', 'çÉ', 'éÂ', 'Þ»', 'Ú¾', 'Û¬', 'ï¯', 'ÛÙ', 'æü', 'ñË',
    'Øª', 'àÃ', 'Üª', 'ë¡'{, 'ëõ'}, 'ïÓ', '÷À', 'ÛÁ', 'ô´', 'ò´', 'íÑ', 'ßç', 'Ø¨',
    'ôÞ', 'Ý¢', 'âÙ', 'ßì', 'ç®', 'öá', 'ëÅ', 'ò¼', 'ö¡', 'çî', 'Øþ', 'çÃ', 'óô',
    '÷¸', 'á¸'{, 'èÛ'}, 'óÑ', 'Ú¸', 'æÅ', 'ì°', 'åÜ', 'êí', 'éï', 'ð³', 'ÝÔ', 'òÁ',
    'õý', 'ôþ', 'ì±', '÷½', 'ãé', 'Ú¬', 'êô', 'î¹'{, 'îÜ'}, 'ØÅ', 'ëû', 'î­', 'áÄ',
    'èô', 'êö', 'ðó', 'ïÀ', 'öñ'{, 'ëÒ'}, 'ð»'{, 'ßÉ'}, 'ØÔ', 'Ú´', 'ÙÄ', '÷¤', 'Þè',
    'äÊ', 'îÂ', 'ðÙ', 'ßÛ', 'èæ'{, 'ë×'}, 'áî', 'æ£', 'ð§', 'öÙ', 'å³', 'âÑ', 'ØÐ',
    'êÐ', 'óþ', 'ØÛ', 'êÁ', '÷¬', 'Ùò', 'çµ', 'íÞ', 'öç', 'ßÃ', 'Ûö', 'áÆ', 'ñø',
    'òå', 'àþ', 'Þâ', 'ë½', 'Ùå', 'â£', 'é¤', 'òä', 'èí', 'Ý¸', 'ßÈ':
    Result := 'g';
    'ðÀ', 'îþ', 'àË', 'ëÜ', 'õ°', 'ñü', 'òÀ', '÷ý', 'Úõ', 'êÏ', 'ìÊ', 'ÝÕ', 'ò¥',
    'Þþ', 'å«', 'ç¬', 'ñþ', 'ãì', 'Ýï', 'àã', 'Þ¶', 'òº', 'àÆ', 'å©', 'ê»', 'ð©',
    'ò«', 'å°'{, 'Ú­'}, 'àÀ', 'ÛÀ', 'êÂ', 'îÁ', 'ò¢', 'ãØ', 'ôç', 'ÛÖ', 'èì', 'çñ',
    'Þ¿', 'Ùê', 'Þ°', 'ãÈ', 'ãü', 'Ý¦', 'Þ®', 'Ùä', 'Ú§', 'ðú', 'óó', 'ô×', '÷¿',
    'ºó', 'åË', 'Ü©', 'ö×', 'ò®', 'ìÃ', 'éõ', 'ßü', 'ã±', 'äï', 'àñ'{, 'õú'}, 'â©',
    'ìÎ', 'ðÉ', 'éÎ', 'õ­', 'ì²', 'ä°'{, 'çú'}, 'Ùü', 'á²', 'âï', 'ìæ', 'ìï', 'óË',
    'ìè', 'ð­', 'ð×', 'æè', 'îü', 'èë', 'õ×', 'âµ', 'ä¡', 'ÝÈ', 'ïÌ', 'å¾', 'çÙ',
    '÷ß', 'Û¼', 'ä½', 'åÕ', 'äñ', 'öé', 'ß§', 'ëÁ', 'Úò', 'áå', 'äÒ', 'åØ', 'äê',
    'è«', 'óò'{, 'ñ¥'}, 'ó¨', 'öü', 'Ú¶', 'ßÔ', 'ò³', 'êÍ', 'çõ', '÷â', 'ãÄ', 'ä§'{,
    'Üî'}, 'ßÜ', 'ä«'{, 'Üö'}, 'í£', 'åç', 'à¹', 'çÀ', 'Þ¥', 'ó³', 'ãÔ', 'âÆ', 'Ú»',
    'äã', 'ñë', 'ïÁ', 'Øå', 'ß«', 'îØ', 'â·', 'ïì', 'àë'{, 'Þ½'}, 'ó¶', 'í¹', 'à÷',
    'áá':
    Result := 'h';
    #0: Result := 'i';
    'Ø¢', 'ß´', 'ØÀ', 'çá', 'Ü¸', 'í¶', 'ßÒ', 'ØÞ', 'ßó', 'åì', 'óÇ', 'ïú', 'ê÷',
    'êå', 'õÒ', 'çÜ', 'ì´', 'ÛÔ', 'î¿', 'á§', 'Ø½', 'Ù¥', 'óÅ', 'ê«', 'éê', 'é®',
    'Ýð', 'ñ¤', 'Þª', 'ò±', 'Þá', 'êª', 'áÕ', '÷ä', 'ÜÁ', 'ßâ', 'ä©', 'êé', 'ÙÊ',
    'ôß', 'õÕ', 'ö«', 'öÝ', 'ð¢', 'öê', '÷Ù', 'æ÷', 'åÈ', 'ä¤', 'çì', 'ðè', 'óÕ',
    'ôÂ', 'Ýç', 'õÊ', 'ïØ', 'áµ', 'Û£', 'í¢', 'ê©', 'îò', 'òÌ', 'ëÎ', 'ðý', 'ê§',
    'ÝÑ', 'äÕ', 'êù', 'Þö', 'çÌ', 'Ýó', 'öä', 'ðÏ', '÷µ', 'àî', 'èÅ', 'óÈ', 'õÂ',
    'íú', 'ñÐ', 'ïµ', 'ÚÙ', 'ê¯', 'ôå', 'åÀ', 'å¿', 'êð', 'ÚÉ', 'é¥', 'ë¦', 'ëì',
    'ÙÔ', 'õÝ', 'Üü', 'ôø', 'çÖ', 'íä', 'ñð', 'ä®', 'ç­', 'êñ', 'ôÝ', 'Ü´', 'æ¯',
    'Üú', 'òÔ', 'õÓ', 'ÙÕ', 'öÞ', 'ðÔ', 'Ù®', 'ÞØ', 'ð¨', 'ë¸', 'áè', 'àÝ', 'õ´',
    'ðÜ', 'à®', 'àµ', 'æÝ', 'Ú¦', 'Úµ', 'Þ×', 'èî', 'æ¼', 'ò¡', 'íÙ', 'öÚ', 'ôÉ'{,
    'ò»'}, '÷º', 'îÄ', 'ñæ', 'ñÆ', 'Úá', 'ÝÀ', 'âÛ', 'âË'{, 'éÈ'}, 'èª', 'æ¡', 'Ý£',
    'êá', 'çÆ', 'êî', 'àä', 'ãþ', 'ìº', 'Ý¼', 'ëæ', 'Úå', 'ØÙ'{, 'ëÂ'}, 'ÙÓ', 'ã½',
    'åò', 'åÉ', 'ëÖ'{, 'æº'}, 'â°', 'ìç', 'åÄ', 'ð¯', 'ôñ', 'ãÎ', 'à±', '÷Ý', 'èÑ',
    'èê', 'àÙ', 'æÞ', 'çå', 'áÈ', 'èö', 'õû', 'ØÊ', 'Øã', 'ÚÜ', 'â±', 'Þ§', 'éÓ',
    'ïã', 'õê', 'ÛÇ', 'ìß', 'ñä', 'óÞ', '÷å', 'ÞÜ', 'æù', 'ÛÈ', 'ÙÖ', 'ðÕ', 'ÜÚ',
    'Þä', 'é§', 'è¢', 'ï¸', 'ñÕ', 'öÂ', '÷¶', 'Üì', 'é·', 'é°', 'ö´', 'õá', 'Úª',
    'ÜÄ', 'îÒ', 'ÙÆ', 'êø', 'ì«', 'ñÀ', 'åð', 'åá', 'õ¶', 'ä¸', 'ïÔ', 'îÃ', 'ïÃ',
    'èð', 'áú', 'öÁ', 'Û²':
    Result := 'j';
    'òÂ', 'ßÇ', 'Øû', 'ëÌ', 'ï´', 'ØÜ', 'Ûî', 'âý', 'îø', 'ÝÜ', 'ïÇ', 'âé', 'íè',
    'ê¬', 'Ù©', 'Ý¨', 'ãÛ', 'î«', 'Øø', 'ãÊ', 'îÖ', 'åê', 'èà', 'îí', 'êû', 'çæ',
    'éð', 'ðâ', 'îÝ', 'ò¤', 'ïý', 'ñ½', 'î§', 'òò', '÷Á', 'á³', 'ã¡', 'ë´', 'æì',
    'ç¼', 'à¾', 'äÛ', 'ï¾', 'ñÌ', 'ï¬', 'ÙÅ', 'áÇ', 'óí', 'ÜÒ', 'íî', 'ßµ', 'óØ',
    'Þ¢', 'ØÚ', 'Ü¥', '÷¼', 'ç«', 'à·', 'Ù¨', 'Øá', 'Û¦', 'ßà', 'áö', 'ëÚ', '÷Å',
    'Ú²', 'ßÑ', 'Ú¿', 'ÞÅ', 'Ú÷', 'ÛÛ', 'æþ', 'êÜ', 'ã¦', 'åÓ', 'Ø¸'{, 'à­'}, 'Þñ',
    'êÒ', 'î¥', 'òñ', 'Ùç', 'õÍ'{, 'ØÑ'}, 'à°', 'ã´', 'ÝÞ', 'óñ', 'ñù', 'çû', 'ï¿',
    '÷Õ', 'õ«', 'öï', 'ã§', 'ãÍ', 'èé', 'òÒ':
    Result := 'k';
    'Ùû'{, 'ö¦'}, 'åå', 'ê¹', 'íÇ', 'ØÝ', 'ðø', 'áÁ', 'áâ', 'äµ', 'ïª', 'êã', 'íù',
    'äþ', 'ñ®', 'ô¥', 'á°', 'ñÜ', 'ìµ', 'ïç', 'é­', 'äí', 'î½', 'à¥'{, 'Ý¹'}, 'ïü',
    'ï¶', 'òë', 'ãÏ', 'Ýõ', 'ßë', 'áÀ', 'ðì', 'ï©', 'õ²', 'èá', 'îî', 'ñì', 'Øì',
    'ß·', 'ãî', '÷¦', 'æÐ'{, 'çÐ'}, 'éÛ', 'Ùú', 'ñç', 'Ú³', 'õª', 'àÏ', 'Ü¨', 'ã¶',
    'æê', 'à¬', 'ð¿', 'çÊ', 'Ýñ', 'òÛ', 'æË', 'öâ', 'î¾', 'Þ¼', '÷ó', 'ó»', 'Ùµ',
    'æ²', 'åÎ', 'ï®', 'å¢', 'õ·', '÷¯', 'ß¿', 'ÛÞ', 'ÜÂ', 'ìå', 'èÀ', 'ðÝ', 'Ù³',
    'èÝ', 'ðß', 'éö', 'Ûª', 'áû', 'íÂ', 'Ý°', 'à¦', 'óÒ', 'ôÏ'{, 'òÃ'}, 'îº', 'õÈ',
    'ö¨', 'äà', 'óö', 'ÞÆ', 'ñÍ', 'öã', 'å¥', 'ì¡'{, 'ó¹'}, 'çö', 'ñÏ', 'Ýü', 'æ®',
    'éç', 'é¬', 'äò', 'é£', 'Ü®', 'õÔ', '÷Ë', 'àÚ', 'å¼', 'â²', 'çÔ', 'ðÓ', 'îÉ'{,
    'Þ¤'}, 'ÞÍ', 'ßÖ', 'Ùý', 'ä£', 'Ûø', 'Þæ', 'ôó', 'õñ', '÷à'{, 'ßø'}, 'ôÔ', 'á×',
    'åà', 'ê¥', 'î¬', '÷ë', 'âÞ', 'ãÁ', 'éÝ', 'Ýþ'{, 'ì¢'}, 'õï', 'àò', 'ãö'{, 'Üß'},
    'èÚ', 'ê²', 'èù', 'ç±', 'ôá', 'ñö', 'òÈ', 'öì', 'Û¹', 'ßÊ', 'ìÖ', 'ä¯', 'ì¼',
    'åÞ', 'æò', 'ïÖ', 'öÌ', 'ç¸', 'ï³', 'ðÒ', 'ãñ', 'Ü×', 'èÐ', 'çç', 'ëÊ', 'íÃ'{,
    'ñª'}, 'Ûâ', 'ÙÍ'{, 'ÙÍ'}, 'à¶', 'Ýä', 'ñï', 'ò÷', '÷Ã', 'áÐ', 'ðü', 'ïÎ', 'àà',
    'ß£', 'Ûä', 'ãò', 'èÓ', 'ëÍ', 'éñ', 'ðµ', 'ôµ', 'öÔ', 'éÖ', 'ïå', 'éû', 'äË',
    'åÖ', 'äõ', 'ê¤', 'è´', 'óü', 'ðØ', 'ëª', 'ãÌ', 'éµ', 'ïù':
    Result := 'l';
    'ëö', 'ñÚ', 'èï', 'ð½', 'Ùõ', 'öÇ', 'ï²', 'àð', 'ÞÛ', 'â¤', 'ëá', 'é¡', 'ïÝ',
    'ÙÀ', 'ñ§', 'Ùù', 'ãø', 'Üý', 'çó', 'Þû', 'äð', 'öÃ', 'ß¼', 'æÖ'{, 'ó¡'}, 'áï',
    'è¿', 'ßé', 'ö²', 'Ý¤', 'Û½', 'ò©', '÷´'{, '÷©'}, 'òý', 'Ü¬', 'á£', 'çÏ', 'ì×',
    'ïÜ', 'Úø', 'íË', 'äÝ', 'òþ', 'êó', 'ì¸', 'òÖ', '÷Ö'{, 'òú'}, 'ó±', 'á¹', 'ã÷',
    'Üâ', 'êÄ', 'ë£', 'Ùó', 'è£', 'î¦', 'í®'{, 'Ý®'}, 'áÒ', 'äØ', 'â­', 'é¹', 'ïÑ',
    'ðÌ', 'ä¼', 'ñÇ', '÷È', 'ÞÑ', 'îÍ', 'ìË', 'í¯', 'òµ', 'Ýù', 'Þ«', 'ëü', 'íæ',
    'ô¿', 'ÛÂ', 'ô»', 'òì', 'ãÂ', 'ó·'{, 'ßä'}, 'ìò', 'â¨', '÷ã', '÷ç', 'ÞÂ', 'ØÂ',
    'åô', 'ôÍ', 'ëß', 'ôé', 'ãè', 'åµ', 'Ú×'{, 'à×'}, 'ãæ', 'ö¼', 'íí', 'äÏ', 'ëï',
    'ß÷', 'ðÅ', 'èÂ', 'íð', 'íµ', 'ç¿', 'åã', 'ßã', 'óú', 'óº', 'áº', 'çä', 'Üå',
    'çë', 'çÅ', 'ãÉ', 'ãý', 'íª', '÷ª', 'Üø', 'Ú¤', 'äé', 'êÔ', 'î¨', 'õ¤', 'çÑ',
    'ÚÓ', 'æÆ', 'âÉ', '÷á', 'éâ'{, 'ÜÔ'}, 'ï÷', 'Ýë', 'õö', 'ñ¢', 'ïÒ', 'õø', 'ñò',
    'ßè', 'Ù°', 'íø', 'öÊ', 'ë¤', 'Øï', 'ãå', 'Ûé', 'ÜÙ', 'îâ', 'äÅ':
    Result := 'm';
    'ÞÖ', 'ÞÃ', 'Ø¿', 'ïÕ', 'ëÇ', 'ñÄ', 'Þà', 'Üµ', 'èÍ'{, 'ÝÁ'}, 'Ø¾', 'àï'{, 'à«'},
    'éª', 'ôö', 'ëî', 'òï', 'àì', 'âÎ', 'êÙ', 'ß­', 'Ø«', 'ßÎ', 'íÐ', 'îó', 'â®',
    'òÍ', 'Ûñ', 'è§', 'Ú«', 'Ûè', 'âõ', 'îê', 'â¥', 'öò', 'Ù£', 'ì»', 'êÇ', 'íþ',
    'öÓ', 'öó', 'ð¤', 'éý', 'Ø¥', 'Ûþ', 'Üà', 'ôÁ', 'æÕ'{, 'ëå'}, 'Úí', 'ô«', 'à¿',
    'ò¨', 'õæ', 'ÞÁ', 'ßÌ', 'ñ÷', 'Øú', 'å¸', 'æ¤', 'âî', 'áð', 'Ù¯', 'ßæ', 'ññ',
    'æÛ', 'æå', 'åó', 'æÀ', 'îÏ', 'í¤', 'ô¬', 'ÙÐ', 'ßö', 'Þù', 'ï»', 'í¥':
    Result := 'n';
    'àÞ', 'Ú©', 'ê±', 'ñî', 'âæ':
    Result := 'o';
    'îÙ', 'ÞÕ', 'áÝ', 'Ú¢', 'Ýâ'{, 'èË'}, 'óá', 'Ù½'{, 'ßß'}, 'Ýå', 'ãÝ', 'õç', 'ó´'{,
    'ãú'}, 'ñÈ', 'ñá', 'äè', 'åÌ', 'ó¦', 'ëã', 'âÒ', 'áó', 'ÞË', 'ðå', 'õ¬', 'ïÂ',
    'àú', 'ì·', 'àÎ', 'ö¬', 'äÔ', 'âñ', 'àØ', 'Ü¡', 'ó²', 'Ø§', 'ç¢', 'Úü', 'îë',
    'àè', 'ÜÅ'{, 'èÁ'}, 'ò·', 'Û¯', 'Úð', 'Ûý', 'î¼', 'òç', 'õù', 'Ü±', 'âÏ', 'Øò',
    'ÛÜ', 'ß¨'{, 'ñ±'}, 'äÄ', 'æÇ', 'î¢', 'ê¶', 'êú', 'ôæ', 'æé', 'ëÝ', 'õä', 'ÚÒ',
    'Øâ', 'çÎ'{, 'óª'}, 'éè', 'î©'{, 'àÑ'}, 'æÎ', 'ë­', 'Ø¯', 'ÜÖ', 'æ°', 'æÉ', 'ò­',
    'é¯', 'êò', 'æ³', 'Ù·', 'èÒ', 'öÒ', 'îÇ', 'Û¶', 'ð«', 'ØÏ', 'îÞ', 'óÍ'{, 'çê'},
    'Þå', 'Ùö', 'ê·', 'àÛ', 'Ùé', 'è±', 'å§', 'ïä', 'äß', 'ë«', 'ïè', 'õë', 'ØÖ',
    'âà', 'ÞÌ':
    Result := 'p';
    'ØÎ', 'ñÊ', 'äÐ', 'á½', 'ôò'{, 'öÄ'}, 'èç', 'ÝÂ', 'àÒ', 'éÊ', 'õè', 'ØÁ', 'Ûß',
    'áª'{, 'ÜÎ'}, 'êÈ', 'ñý', 'ä¿', 'Ý½', 'æë', 'çù', 'ç÷', 'ì÷', 'òÓ', 'ôë', 'òà',
    'Þ­', '÷¢', '÷è', 'á¨', 'Ü»'{, 'è½'}, 'ç²', 'ôì', 'ãà', 'Üù', 'ÝÝ', 'íÓ', 'í¬',
    'ÝÖ', '÷Ä', 'Úä', 'Ü·', 'ÙÝ', 'á©', 'ã¥', 'í©', 'å¹', 'åº', 'å½', 'îÔ', 'ò¯',
    'Þç', 'óé', 'ëÉ', 'ã»', 'ç×', 'ÜÍ', 'Üç', 'Ù»', 'èý', 'ãÞ', 'ê¨', 'õÄ', 'òÞ',
    'ïº', 'ïÏ', 'ïê', 'æÍ', 'éÉ'{, 'ôÇ'}, 'ñß', 'ìÁ', 'íÍ', 'õÎ', 'Øä', 'çØ'{, 'Üñ'},
    'ÚÛ', 'ã¾', '÷³', 'éÔ', 'ã¸', 'Ú½', 'æª', 'êü', 'ã«', 'óæ', 'ïÆ', 'ôÀ'{, 'ÜË'}{,
    'àº'}, 'äÚ', 'àß', 'éÕ', 'òû', 'ï·', 'ßÄ', 'Þì', 'àõ', 'òß', 'öë', 'éÑ', '÷ô',
    'ÜÜ', 'ö¥', 'óä', 'íà', 'óÀ', 'õ¼', 'öÆ', 'Úö', 'ñ·', 'Üä', 'óÌ', 'òË', 'òÇ',
    'é±', 'öú', 'áì', 'ò°', 'Ù´', 'åÏ', 'êä'{, 'ÛÏ'}, 'åÙ', 'ôÃ', 'òø', '÷ü', 'ôÜ',
    'á«', 'Ú°'{, 'ìî'}, 'òÐ', 'ôð', '÷ñ', 'Û¾', 'ëÔ', 'ð¶', 'Þ¡', 'íá', 'è³', 'Þ¾',
    'ë¬', 'ñ³', 'áé', 'ó½', 'ãÖ', 'êï', 'ãª', 'Ú¹', 'Üõ', 'éú', 'îý', 'óÜ', 'òé',
    '÷Ü', 'î°', 'ç¹', 'í¨', 'ã×', 'ãÚ', 'åÒ', 'Û§'{, 'ïê'}:
    Result := 'q';
    'òÅ'{, '÷×'}, 'ÜÛ', 'ìü', 'ð¦', 'Üé', 'èã', 'æ¬', 'Üó', 'ïþ', 'Øð', 'éí', 'â¿',
    'ñÅ', 'ëÀ', 'áõ', 'áÉ', 'éÅ', 'òî', 'ôÛ', 'õå', '÷·', 'ï¨', 'àé', 'å¦', 'Þ¸',
    'ñà', 'ò¬', 'ä²', 'äá', 'çÈ', 'Ýê', 'ëÃ', 'Þ¨', 'ÜÇ', 'èÄ', 'ò¸', 'î£', 'Ù¼',
    'óè':
    Result := 'r';
    'ìá', 'è¼', 'Ø­', 'ÛÉ', 'ÝØ', 'Øí', 'Ø¦', 'ìª', 'ëÛ'{, 'àç'}, 'ë§', 'ôÖ', 'âÌ',
    'Þú', 'íß', 'òª', 'çÒ', 'ëý', 'öþ', 'Ü£', 'ðþ', 'ØÄ', 'ï¤', 'ð£', 'ï¡'{, 'ðð'},
    'ôÄ'{, 'öè'}, 'ßþ', 'ì¦', 'ö®', 'áê', 'ÜÏ', 'æ©', 'îÌ', 'Ûï', 'ô®', 'õÇ', 'äú',
    'ëþ', 'Ú¨', 'ðÞ', 'æó', 'Û·', 'æÓ', 'óµ', '÷­', 'éä', 'õü', 'ìØ', 'Ûð', 'ç´',
    'óâ', 'ô¹', 'òÙ', 'Û¿', 'äû', 'â¦', 'î´', 'ÙÜ', 'ØÇ', 'äÜ'{, '÷ê'}, 'Ú·', 'ßÓ',
    'ïò', 'ÚÅ', 'äÉ', 'ëÏ', 'é©', 'ò×', 'óÏ', 'íò', 'êÉ', 'áÓ', 'Ýé', 'õ§', 'öõ',
    'â»', 'ìÂ', 'Ûõ', 'Ýª', 'öå', 'õ¹', 'ìê', 'êÛ', 'óÂ', 'éø', 'îæ', 'ß±', 'ÚÖ',
    'óß', 'ó§', 'ô¼', 'á÷', 'ç·', 'ì¯', 'ç£', 'æ­', 'Ù¿', 'ÝÄ', 'Þó', 'ë¨', 'ïø',
    'ÛÓ', 'ãð', 'ëò', 'äø', 'à§', 'ó°', 'ãÅ', 'äÌ', 'æ×', 'ãß', 'åù', 'îå', 'àÊ',
    'Þ÷', 'Ýô', 'éÃ', 'ÛÌ', 'ßÐ', 'ð¸', 'çÁ', 'òÏ', 'ØË', 'ïÈ', 'äù', 'ãá', 'Ùî',
    'æ¦', 'ìë', 'ãô', 'æá', 'Ù¹', 'óÓ', 'ñê', 'âì', 'Ú¡', 'áÂ', 'äÁ', 'Ý¿', 'áÔ',
    'ìÝ', 'åä', 'áø', 'Ý¥', 'â¸', 'öÀ', 'é¾', 'æ¶', 'êý'{, 'êý'}{, 'êý'}, 'èø', 'íü',
    'àÂ', 'ßï', 'Ý·', 'ã¤', 'ñµ', 'à²', 'äÑ', 'âÈ', 'ì¬', 'ïË', 'òô', 'ÛÅ', 'àÕ',
    'î¤', 'Þ´', 'öÕ', 'Ùí', 'ä³', 'ÚÕ', 'à¼', 'ãº', 'Ýø', 'ö¢', 'óù', 'â¡', 'Ý´',
    'íõ', 'î¡', 'å¡', 'ÚÇ':
    Result := 's';
    'í³', 'ß¾', 'ìâ', 'î×', 'Øç', 'Üæ', 'ÞÐ', 'õÁ', 'îè', 'äâ', '÷£', 'ãË', 'åÝ',
    'é½', 'ææ', 'Û¢', 'ìÆ', 'õÌ', 'öØ', 'Þ·'{, 'ëÄ'}, 'îÑ', 'ê¼', 'Û°', 'ñû', 'ïÄ',
    'ìþ', 'îã', 'ï¦', 'ôÊ', 'ïÛ', 'â¼', 'äç', 'è©', 'éÌ', 'ó¥', 'ó«', 'õ±', 'àû',
    'ÙÎ', 'ñí', 'èº', '÷Ò', 'ä¬', 'ßû', 'Ø»', 'ìý', 'ß¯', 'ï«', 'í«', 'ëø', 'ç°',
    'ç¾', 'ðÃ', 'õ®', 'ÙÃ', 'ã©', 'åÑ', 'ñÓ', 'î±', 'ãÙ', 'ãÃ', 'éå', 'ÞÝ', 'Ù¬',
    'ìö', 'óÔ', 'ö¶', 'òè', '÷Ø', 'öæ', 'ñ»', 'ôÐ', 'ÝÆ', '÷Ñ', 'Üð', 'æÃ', 'Ýã',
    'òÑ', 'öª', 'èè', 'àÌ', 'ÙÚ', 'Ù¡', 'Üí', 'íÅ', 'Ù×', 'äü', 'âú', '÷»', 'Ý±',
    'õ©', 'îÊ', 'Ü¢', 'ÝË', 'ÞÒ', 'î¶', 'åè', 'ìÕ', 'êÕ', 'â½', 'ëà'{, 'ÙÛ'}, 'Ø±'{,
    'Ù¢'}, 'Ûç', 'ãû', 'èÞ', 'íÈ', 'õÉ', 'õ¢', 'éÒ', 'ö¾', 'âÕ', 'èØ', 'óê':
    Result := 't';
    'Ùï', 'æ´', 'Øô', 'ëð', 'áË', 'Øà', 'òê', 'æý', 'Ü¹', 'çº', 'ëä', 'ÝÒ', 'çþ',
    'îµ', 'Øè', 'ã¯', 'éþ', '÷Í', 'ÙË', 'åÔ', 'Úñ', 'ÝÚ', 'ìÐ', 'Þ±', 'àí', 'àø',
    'ãí', 'ãÇ', 'ä¶', 'á¡', 'áÍ', 'ì¿', 'çâ', 'ä¢', 'æ¸', 'ÚÃ', 'Úó', 'â«', 'ðô',
    'ôº', 'è¸', 'öÛ', 'ê¦', 'â¬', 'ãÓ', 'ö©', 'ØØ', 'ãë', 'è·', 'Ýî', 'Þ³', 'ÙÁ',
    'Ý«', 'à¸'{, 'ë¿'}, 'á¢', 'ä×', 'íÒ', 'ö»', 'ÛØ', 'Úù', 'ä´', 'òÚ', '÷ù', 'Øõ',
    'åü', 'âÐ', 'âè', 'âä', 'åÃ', 'êõ', 'ðÄ', 'Ø£', 'Úã', 'è»', 'ÜÌ', 'ìÉ', 'æÄ',
    'ðí', 'æð', 'å»', 'ðÍ', 'öÈ':
    Result := 'w';
    'Û¨', 'åæ', 'àå', 'Ý¡', 'Û×', 'Ùâ', 'ñ¶', 'Û­', 'ßñ', 'ÞÉ', 'ä»', 'ì¤', 'äÀ',
    'Ý¾', 'ôÑ', 'ôâ', 'ô¸', 'ðª', 'ÙÒ', 'òá', 'æÒ', 'éØ', 'ì¨', 'ìä', 'ôË', 'ó£',
    'ó¬', 'õµ', 'êØ', '÷û', 'êê', 'Úô', 'çô', 'áã', 'Ýß', 'åï', 'Ýû', 'ìû', 'â¾',
    'ãÒ', 'ôª', 'ìù', 'áò', 'èÔ', 'íÌ', 'åÚ', 'è¦', '÷ï', 'óÁ', 'ë¯', 'ìì', 'ôÌ',
    'Ý²', 'õÑ'{, 'õ£'}, 'åß', 'æµ', 'ðï', 'ðÂ', 'Ùþ', 'áý', 'ò¹', 'óÚ', 'õÐ', 'Þº',
    'ìÞ', 'á­', 'ÜÈ', 'ö±', 'Ü¼', 'ç½', 'ÝÙ', 'æø', 'âÔ', 'âÃ', '÷Ï', 'öß', 'ó­',
    'èÉ', 'ßØ', 'èÕ', 'æç', 'ç¯'{, 'åÐ'}, 'äì', 'óï', '÷Ì', 'áÅ', 'óã', 'ÙÉ', 'ÛÄ',
    'ß¢'{, 'çÓ'}, 'Þ¦', 'ç¥', 'Ùô', 'äÍ', 'éÇ', 'é¿', 'âÝ', 'â³', 'Þ¯', 'åâ', 'ÛÆ',
    'å¬', 'õó', 'ê¿', 'ì§'{, 'Ü°'}{, 'öÎ'}, 'Ø¶', 'Úê', 'íÊ', 'ß©', 'Üô', 'ã¬'{, 'Üº'},
    'ßÝ', 'âÓ', 'ð¼', 'õ÷', 'âÊ', '÷Û', 'á¶'{, 'äå'}, 'íì', 'ñã', 'çï', 'Ú¼', 'èò',
    'ôÚ'{, 'õ¯'}, 'äª', 'ÛÃ', 'äÓ', 'ìã', 'Þ£', 'ÚÎ', 'Þï', 'Ýæ', 'êÑ', 'ìÓ', 'ÙØ',
    'ðç', 'äö', 'è¯', 'ãù', 'ìÅ', 'îç', 'äÖ', 'é¸', 'íÛ', 'ïà', 'í´', 'õ½'{, '÷¨'},
    'ÚÊ', 'Û÷', 'ñ¿', 'â´', 'Þ¹', 'êÖ', 'õ¸', 'á¾', 'âþ', 'ä­', 'ä±', 'Ü÷', 'öà',
    'áß', 'Ùã','Ñ§','Ñ©':
    Result := 'x';
    'í±', 'Øß', 'èâ', 'Øó', 'á¬', 'çð', 'íý', 'ðé', 'åÂ', 'Ûë', 'æ«', 'í¼', 'ë²',
    'Þë', 'âû', 'ëÙ', 'áÃ', 'ÝÎ', 'äÎ', 'ëç', 'Û³', 'æÌ', 'Ú¥', 'ãÆ'{, 'åû'}, 'Ü¾',
    'óÛ', 'éÜ', 'Ùð', 'Ù²', 'ÙÈ', 'ØÉ', 'Û±', 'çü', 'î»', '÷Ê', '÷ú', 'êÌ', 'ìÍ',
    'äÙ', 'õ¦', 'ÚÝ', '÷Ð', 'ØÍ', 'ãó', '÷±', 'ì¾', 'áà', 'ìÈ', 'òÕ', 'âó', 'í¦',
    'çÛ', 'Ø²', 'ßº', 'Ø³', 'ëÈ', 'é÷', 'çò', 'áæ', 'ôí', '÷¥', 'èÃ', 'ñº', 'áÊ',
    'ðÎ', 'ê×', 'ÞÞ', 'îô', 'Úþ', 'êÊ', 'ìÇ', 'ÚË', 'ØÌ', 'ñÂ', 'ßÞ', 'â¢', 'ì¥',
    'äô', 'àæ', '÷ð', 'ÛÝ', 'Ú±'{, 'âù'}, 'åÆ', 'âÂ', 'ß×', 'Üè', 'êÝ', 'íô', 'ôý',
    'ðê', 'áÚ', 'îÆ', 'ÜÓ', 'ô¯', 'ì½', 'ß®', 'Ø×', 'Øî', 'Øý', 'ß½', 'Ù«', 'á»',
    'âø', 'æä', 'ÞÈ', 'ÞÄ', 'ôà', 'éó', 'ã¨', 'ÞÚ', 'Ûü', 'ñ´', 'çË', 'ðù', 'òæ',
    'ìÚ', 'ï×', 'Øæ', 'éì', 'Þ²'{, 'ôè'}, 'ñ¯', 'ïî', 'Ü²', 'ä¦', 'ë³', 'î÷', 'à³',
    'Ü§', 'Ûó', 'áþ', 'Û´', 'â¹'{, 'ö¸'}, 'ö¯'{, 'ßÅ'}, 'ò¾', 'ñ«', 'Üá', 'Ø·', 'Ýº',
    'çø', 'àÓ', 'Þü', 'ó¿', 'è¬', 'ðÐ', 'âß', 'Üã', 'Üþ', 'ÝÓ', 'éº', 'äÞ', 'Ýö',
    'äë', 'Ùø', 'å­', 'Û«', 'ò£', 'ñ¨', 'ëô', 'à¡', 'çß', 'Ü­', 'ã¼', 'ÛÕ', 'ïÞ',
    '÷«', 'áü', 'ÚÄ', 'âÅ', 'ÝÇ', 'ö§', 'áÎ', 'Þí', 'ëé', 'è¤', 'êì', 'ñâ', '÷Ó',
    'à¯', 'ð®', 'Ù¸', 'Øü', 'ßÏ', 'èÖ', 'ðà', 'Ý¯', 'Ýµ', 'òÄ', 'öÏ', 'éà', 'òö',
    'ØÕ', 'Ý¬', 'îð', 'ë»', '÷î', 'Ù§', 'àó', 'å¶', 'òÊ', '÷ø', 'æú', 'æ¥', 'ì£',
    'ì¶', 'ô§', 'Ø®', 'óÄ', 'ô¨', 'ñ¾', 'òõ', 'Øñ', 'Ù¶', 'àô', 'àö', 'â×', 'ðõ',
    'ñÁ', 'ö¹', 'í²', 'åý', 'âÀ', 'êÅ', 'îÚ', 'ÚÍ', 'ãÐ', 'ðÁ', 'ìÏ', 'Ý÷', 'Ø¹',
    'òâ', 'ìÛ', 'ðÖ', 'å÷', 'ð°', 'íó', 'óî', 'ãä', 'ë¼', 'ö½', 'Ü«'{, 'éÚ'}, 'ó¢',
    'Ûù', 'æÂ', 'Þò', 'è¥', 'ë¾', 'îá', 'éÐ', 'Ùß', 'å®', 'ç¡', 'Ü¿', 'êÀ', 'ëµ',
    'áñ', 'éæ', 'Û©', 'ã¢', 'ã³', 'è¹', 'ìÙ':
    Result := 'y';
    'åÁ', 'ä·', 'ÚÂ', 'ìú', 'ßª', 'åª', 'ïí', 'êß', 'ç»', 'ÚÑ', 'æÜ', 'áÑ', 'ôÒ',
    'ê¢', 'õþ'{, 'õþ'}, 'ôô', 'ïÅ', 'ö·', '÷Ú', 'öö', 'æ¢', 'ïö', 'ñè', 'óÊ', 'è÷',
    'ö¤', 'í§', 'íö', 'ÙÌ', 'ôÕ', 'æã', 'ÚÁ', 'Úî', 'Û¸', 'öí', 'õ¡'{, 'à©'}, 'Úâ',
    'ßÆ', 'ÞÙ'{, 'çÞ'}, 'áÌ', 'ôØ', 'ô¢', 'êÃ', 'ôõ', 'öÉ', 'è¶', 'ê°', 'æà', 'ÞÊ',
    'ßð', 'åÅ', 'ßõ', 'àý', 'óÐ', 'ô·', 'óå', 'ØÓ', 'ØÆ', 'ê¾', 'ÚÚ', 'çÕ', 'îÀ',
    'ï­', 'êµ', 'ß¸', 'ßî', 'Þê'{, 'é«'}, '÷þ', 'íÄ', 'ßå', 'ðä', 'òÆ', 'íÎ', 'ñ©',
    'ì¹', 'ÚÞ', 'Þø', 'Ûµ', 'æÑ', 'â¯', 'è°'{, 'ó¯'}, 'Øë', 'áÖ', 'á¤', 'îÈ', 'ßú',
    'Ú¯', 'óÉ', 'èþ', 'òØ', 'éü', 'ÚØ', 'ß¡', 'íÝ'{, 'ô÷'}, 'ñÞ', 'èÏ', 'ðÑ', 'ä¥',
    'èå', 'ìõ', 'Ýè', 'é»', 'óð', 'ëÓ', 'éô', 'î³', 'çÇ', 'ð¡', 'ÛÚ', 'ð²', 'ëÞ',
    'êâ', 'á¿', 'îÛ', 'ï£', 'óÝ', 'áç', 'Úº', 'Ø´'{, 'èÙ'}, 'ìó', 'ëÕ', 'Ûú', 'ôê'{,
    'õÅ'}, 'Þý', 'õÜ', 'ÜÆ', 'ìí', 'åë', 'è×', 'éò', 'íé'{, 'õ¥'}, 'âå', 'õô', 'àù',
    'Û¤', 'èÎ', 'Úì', 'èä', 'êÞ', 'éù', 'ðº', 'åé', 'ðë', 'òÎ', 'æï', 'ïô', 'ëù',
    'ö£', 'õÙ', 'ô±', 'ïñ', 'ó®', 'Ú£', 'õà', 'æ¨', 'íØ', 'æû', 'ç§', 'ëÐ', 'Ý§',
    'ôü', 'ô¦', 'Ùª', 'Û¥', 'ä¨', 'Üï', 'îù', 'éÆ', 'äó', 'éÍ'{, 'óÃ'}, 'ô¶', 'ðñ',
    'õî', 'ä¾', '÷æ', 'Øù', 'ÜÑ', 'èÌ', 'ìÄ', 'ðæ', 'óç', 'ôã', 'ò§', 'ßù', 'âÍ',
    'ãÜ', 'ö¿', 'æí', 'ã·', 'çÄ', 'ëÆ', 'ñ¸', 'Ù¾', 'äÃ', 'í½', 'ÝÏ', 'ïß', 'ÙÞ',
    'õò', 'çÚ', 'ß¬', 'Þ©', 'é×', '÷®', 'ß¤', 'Úè', 'âô', 'ìñ', 'ëÑ'{, 'ßò'}:
    Result := 'z';
  end;
end;


end.
